# FamilyRfaPathPseudoParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FamilyRfaPathPseudoParam Property
ParameterTypeId Class See Also
---
"File Path"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FamilyRfaPathPseudoParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilyRfaPathPseudoParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FamilyRfaPathPseudoParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace